In [ ]:
#1
create table employees(
    emp_id int not null primary key,
    emp_name char(20) not null,
    age int not null check (age>=18),
    email varchar(20) unique,
    salary decimal(10,2) default 30000);

In [ ]:
#2
Purpose of Constraints in a Database:
Constraints are rules that are applied to columns in a database table. They help ensure the accuracy and reliability of the data.
By enforcing certain conditions, constraints prevent invalid data from being entered into the table, helping to maintain data integrity.

1.not null
emp_name varchar(255) not null

2.primary key
emp_id int primary key

3.check
age int check (age>=18)

4.unique
email varchar(20) unique

5.default
salary int default 30000

In [ ]:
#3

1. Why Apply the NOT NULL Constraint to a Column?
   The NOT NULL constraint ensures that a column must always have a value. It prevents missing or undefined values in that column.

2. Can a Primary Key Contain NULL Values?
   No, a primary key cannot contain NULL values.

   Justification:
   A primary key uniquely identifies each row in a table, and NULL represents the absence of a value or an unknown value.
   If a primary key had NULL values, it would mean that some rows have no identifier or that rows with NULL could not be distinguished from one another.

In [ ]:
#4
create table employees(
    emp_id int,
    emp_name char(20),
    age int,
    email varchar(20),
    salary int);

  Adding constrain
alter table employees add constrain unique_email unique(email);
alter table employees add constrain check_age check(age>=18);

  removing constrain
alter table employees drop constrain unique_email;

In [ ]:
#5
Insert Operation:
If you try to insert a record that violates a constraint, the database will reject the entire operation, and no data will be added.

Update Operation:
If an update causes the data to violate a constraint (e.g., updating a foreign key to a non-existent value), the operation will be stopped, and the update will not be applied.

CREATE TABLE employees(
    emp_id INT PRIMARY KEY,
    name VARCHAR(50));

Error Message:
Violation of PRIMARY KEY constraint 'PK__employees'. Cannot insert duplicate key in object 'dbo.employees'.

In [ ]:
#6
mysql> alter table products add primary key(product_id);
       Query OK, 0 rows affected (0.05 sec)
       Records: 0  Duplicates: 0  Warnings: 0

mysql> alter table products modify column price decimal(10,2) default 50.00;
       Query OK, 0 rows affected (0.01 sec)
       Records: 0  Duplicates: 0  Warnings: 0

In [ ]:
#7
mysql> select students.student_name,classes.class_name from students inner join classes on students.classe_id=classes.class_id;

In [ ]:
#8
SELECT
    o.order_id,
    c.customer_name,
    p.product_name
FROM
    Customers c
INNER JOIN Orders o ON c.customer_id = o.customer_id
LEFT JOIN Products p ON o.order_id = p.order_id;

In [ ]:
#9
SELECT
    p.product_name,
    SUM(s.amount) AS total_sales
FROM
    Products p
INNER JOIN Sales s ON p.product_id = s.product_id
GROUP BY
    p.product_name;

In [ ]:
#10
SELECT
    o.order_id,
    c.customer_name,
    od.quantity
FROM
    Orders o
INNER JOIN Customers c ON o.customer_id = c.customer_id
INNER JOIN Order_Details od ON o.order_id = od.order_id;

In [ ]:
#SQL command
#1
SELECT
    TABLE_NAME,
    COLUMN_NAME
FROM
    information_schema.KEY_COLUMN_USAGE
WHERE
    TABLE_SCHEMA = 'mavenmovies'
    AND CONSTRAINT_NAME = 'PRIMARY'
ORDER BY
    TABLE_NAME, ORDINAL_POSITION;

In [ ]:
#2
select * from actor;
desc actor;

In [ ]:
#3
select * from customer;
desc customer;

In [ ]:
#4
select country from country;

In [ ]:
#5
select customer_id,first_name from customer where active=1;

In [ ]:
#6
select rental_id from rental where staff_id=1;

In [ ]:
#7
select title from film where rental_duration>5;

In [ ]:
#8
select title from film where replacement_cost>15 and replacement_cost<20;

In [ ]:
#9
select count(distinct(first_name)) from actor;

In [ ]:
#10
select * from customer limit 10;

In [ ]:
#11
SELECT * from customer where first_name like 'b%' limit 3;

In [ ]:
#12
select title from film where rating='G' limit 5;

In [ ]:
#13
select * from customer where first_name like 'a%';

In [ ]:
#14
select * from customer where first_name like '%a';

In [ ]:
#15
select city_id,city from city where city like ('a%' and '%a') limit 4;

In [ ]:
#16
select customer_id,first_name from customer where first_name like '%ni%';

In [ ]:
#17
select * from customer where first_name like '_r%';

In [ ]:
#18
select * from customer where first_name like 'a%' and char_length(first_name)>=5;

In [ ]:
#19
select * from customer where first_name like 'a%' and '%o';

In [ ]:
#20
select * from film where rating in('PG','PG-13');

In [ ]:
#21
select * from film where length between 50 and 100;

In [ ]:
#22
select * from actor limit 50;

In [ ]:
#23
select distinct film_id from inventory;

In [ ]:
#function
#1
select count(rental_id) from rental;

In [ ]:
#2
select avg(datediff(return_date,rental_date)) as avg_rental_duration from rental;

In [ ]:
#3
select upper(first_name) as first_name,upper(last_name) as last_name from customer;

In [ ]:
#4
select rental_id,month(rental_date) as rental_month from rental;

In [ ]:
#5
select customer_id,count(*) from rental group by customer_id;

In [ ]:
#6
select i.store_id,sum(p.amount) as total_revenue
from payment p
join rental r on p.rental_id = r.rental_id
join inventory i on r.inventory_id = i.inventory_id
group by i.store_id;

In [ ]:
#7
select category_id,count(rental.rental_id)
from film_category
join film on film_category.film_id=film.film_id
join inventory on film.film_id=inventory.film_id
join rental on inventory.inventory_id=rental.inventory_id
group by film_category.category_id;

In [ ]:
#8
select language.name,avg(film.rental_rate)
from language
join film on film.language_id=language.language_id
group by language.name

In [ ]:
#joins
#9
select film.title,customer.first_name,customer.last_name
from film
join inventory on inventory.film_id=film.film_id
join rental on rental.inventory_id=inventory.inventory_id
join customer on rental.customer_id=customer.customer_id;

In [ ]:
#10
select actor.first_name,actor.last_name
from actor
join film_actor on actor.actor_id=film_actor.actor_id
join film on film_actor.film_id=film.film_id
where film.title='Gone with the Wind';

In [ ]:
#11
select customer.first_name,customer.last_name,sum(payment.amount)
from customer
join payment on customer.customer_id=payment.customer_id
join rental on payment.rental_id=rental.rental_id
group by customer.first_name,customer.last_name;

In [ ]:
#12
select customer.first_name,customer.last_name,film.title
from customer
join address on customer.address_id=address.address_id
join city on address.city_id=city.city_id
join rental on customer.customer_id=rental.customer_id
join inventory on rental.inventory_id=inventory.inventory_id
join film on inventory.film_id=film.film_id
where city.city='London'
group by customer.customer_id,customer.first_name,customer.last_name,film.title;

In [ ]:
#13
select f.title,COUNT(r.rental_id) as rental_count
from film f
join inventory i on f.film_id = i.film_id
join rental r on i.inventory_id = r.inventory_id
group by f.title
order by rental_count desc
limit 5;

In [ ]:
#14
select c.customer_id,c.first_name,c.last_name
from customer c
join rental r on c.customer_id=r.customer_id
join inventory i on r.inventory_id=i.inventory_id
group by c.customer_id,c.first_name,c.last_name
having count(distinct i.store_id)=2;

In [ ]:
#window function
#1
select
    c.customer_id,
    c.first_name,
    c.last_name,
    sum(p.amount) as total_spent,
    rank() over (order by sum(p.amount) desc)
function
    customer c
join rental r on c.customer_id=r.customer_id
join payment p on r.rental_id=p.rental_id
group by
    c.customer_id,c.first_name,c.last_name;

In [ ]:
#2
SELECT
    f.title,
    r.rental_date,
    p.amount,
    SUM(p.amount) OVER (PARTITION BY f.title ORDER BY r.rental_date) AS cumulative_revenue
FROM
    film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN payment p ON r.rental_id = p.rental_id
ORDER BY
    f.title, r.rental_date;

In [ ]:
#3
SELECT
    f.title,
    AVG(DATEDIFF(r.return_date, r.rental_date)) AS avg_rental_duration
FROM
    film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY
    f.title;

In [ ]:
#4
SELECT
    c.name AS category_name,
    f.title,
    COUNT(r.rental_id) AS rental_count,
    RANK() OVER (PARTITION BY c.name ORDER BY COUNT(r.rental_id) DESC) AS film_rank
FROM
    category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name, f.title
HAVING film_rank <= 3;

In [ ]:
#5
WITH CustomerRentals AS (
    SELECT
        c.customer_id,
        COUNT(r.rental_id) AS total_rentals,
        AVG(COUNT(r.rental_id)) OVER () AS avg_rentals
    FROM
        customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY
        c.customer_id
)
SELECT
    customer_id,
    total_rentals,
    avg_rentals,
    total_rentals - avg_rentals AS rental_difference
FROM
    CustomerRentals;

In [ ]:
#6
SELECT
    YEAR(r.rental_date) AS rental_year,
    MONTH(r.rental_date) AS rental_month,
    SUM(p.amount) AS monthly_revenue
FROM
    rental r
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY
    rental_year, rental_month
ORDER BY
    rental_year, rental_month;

In [ ]:
#7
WITH CustomerSpending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent,
        PERCENT_RANK() OVER (ORDER BY SUM(p.amount) DESC) AS percentile_rank
    FROM
        customer c
    JOIN rental r ON c.customer_id = r.customer_id
    JOIN payment p ON r.rental_id = p.rental_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
)
SELECT *
FROM CustomerSpending
WHERE percentile_rank >= 0.8;

In [ ]:
#8
SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS rental_count,
    SUM(COUNT(r.rental_id)) OVER (ORDER BY COUNT(r.rental_id) DESC) AS running_total_rentals
FROM
    category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    rental_count DESC;

In [ ]:
#9
WITH CategoryAvgRentals AS (
    SELECT
        fc.category_id,
        AVG(COUNT(r.rental_id)) OVER (PARTITION BY fc.category_id) AS avg_category_rentals
    FROM
        film_category fc
    JOIN film f ON fc.film_id = f.film_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        fc.category_id
)
SELECT
    f.title,
    COUNT(r.rental_id) AS rental_count,
    ca.avg_category_rentals
FROM
    film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN CategoryAvgRentals ca ON fc.category_id = ca.category_id
GROUP BY
    f.title, ca.avg_category_rentals
HAVING

In [ ]:
#10
WITH MonthlyRevenue AS (
    SELECT
        YEAR(r.rental_date) AS rental_year,
        MONTH(r.rental_date) AS rental_month,
        SUM(p.amount) AS monthly_revenue,
        RANK() OVER (ORDER BY SUM(p.amount) DESC) AS revenue_rank
    FROM
        rental r
    JOIN payment p ON r.rental_id = p.rental_id
    GROUP BY
        rental_year, rental_month
)
SELECT
    rental_year,
    rental_month,
    monthly_revenue
FROM
    MonthlyRevenue
WHERE
    revenue_rank <= 5;

In [ ]:
#Normalisation & CTE
#1
while the Sakila database is generally well-normalized
To normalize a table to 1NF, we need to ensure that each cell contains a single, atomic value. This means that each cell should hold only one piece of data, and that data should be indivisible.

In [ ]:
#2
2NF Requirements
A table is in 2NF if:

1)It is in First Normal Form (1NF):
    No repeating groups or arrays.
    Each column contains atomic values.
2)It has no partial dependency:
    No non-prime attribute (a column not part of the primary key) depends only on a part of the composite primary key.
    If the Table Violates 2NF


In this case:

Steps to Normalize:
step1 Split the table into two:
   Table 1: film_actor
            actor_id, film_id, last_update
   Table 2: actor
            actor_id, actor_name
step2 Establish a relationship:
      actor_id in film_actor becomes a foreign key referencing the actor table.

In [ ]:
#3
Third Normal Form (3NF) is the address
Primary key: address_id.
Non-prime attributes: All other columns.

In this case:
city_id is a foreign key referencing the city table.
Transitive dependency: district and postal_code indirectly depend on address_id via city_id. That is:
address_id → city_id
city_id → district, postal_code

To remove transitive dependencies, follow these steps:

1)Create a new city table (if not already defined):

2)Columns: city_id, city_name, district, postal_code, last_update
   Remove transitive attributes (district, postal_code) from address:
   Keep only address_id, address, address2, city_id, phone, last_update.
3)Establish relationships:
  Use city_id as a foreign key in address to reference the new city table.
  Now, attributes like district and postal_code are stored in city, and no transitive dependency exists in address.

In [ ]:
#4
Normalizing a Table in Sakila: rental Table
Step 1: Initial Unnormalized Form
Step 2: First Normal Form (1NF)
tep 3: Second Normal Form (2NF)

In [ ]:
#5
WITH ActorFilmCount AS (
    SELECT
        a.actor_id,
        CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
        COUNT(fa.film_id) AS film_count
    FROM
        actor a
    INNER JOIN
        film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY
        a.actor_id, a.first_name, a.last_name
)
SELECT
    actor_name,
    film_count
FROM
    ActorFilmCount
ORDER BY
    film_count DESC, actor_name;

In [ ]:
#6
WITH FilmLanguageInfo AS (
    SELECT
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
    FROM
        film f
    INNER JOIN
        language l ON f.language_id = l.language_id
)
SELECT
    film_title,
    language_name,
    rental_rate
FROM
    FilmLanguageInfo
ORDER BY
    film_title;

In [ ]:
#7
WITH CustomerRevenue AS (
  SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_revenue
  FROM
    customer c
  JOIN
    payment p ON c.customer_id = p.customer_id
  GROUP BY
    c.customer_id, c.first_name, c.last_name
)

SELECT
  customer_id,
  first_name,
  last_name,
  total_revenue
FROM
  CustomerRevenue
ORDER BY
  total_revenue DESC;

In [ ]:
#8
WITH FilmRentalDuration AS (
  SELECT
    film_id,
    title,
    rental_duration,
    RANK() OVER (ORDER BY rental_duration DESC) AS rental_rank
  FROM
    film
)

SELECT
  film_id,
  title,
  rental_duration,
  rental_rank
FROM
  FilmRentalDuration
ORDER BY
  rental_rank;

In [ ]:
#9
WITH FrequentRenters AS (
  SELECT
    customer_id,
    COUNT(*) AS rental_count
  FROM
    rental
  GROUP BY
    customer_id
  HAVING
    COUNT(*) > 2
)

SELECT
  c.customer_id,
  c.first_name,
  c.last_name,
  fr.rental_count
FROM
  customer c
INNER JOIN
  FrequentRenters fr ON c.customer_id = fr.customer_id;

In [ ]:
#10
WITH MonthlyRentals AS (
  SELECT
    DATE_TRUNC('month', rental_date) AS rental_month,
    COUNT(*) AS total_rentals
  FROM
    rental
  GROUP BY
    DATE_TRUNC('month', rental_date)
)

SELECT
  rental_month,
  total_rentals
FROM
  MonthlyRentals
ORDER BY
  rental_month;

In [ ]:
#11
WITH ActorPairs AS (
  SELECT
    fa1.actor_id AS actor_id_1,
    fa2.actor_id AS actor_id_2,
    f.title
  FROM
    film_actor fa1
  JOIN
    film_actor fa2 ON fa1.film_id = fa2.film_id AND fa1.actor_id < fa2.actor_id
  JOIN
    film f ON fa1.film_id = f.film_id
)

SELECT
  a1.first_name || ' ' || a1.last_name AS actor_1,
  a2.first_name || ' ' || a2.last_name AS actor_2,
  ap.title
FROM
  ActorPairs ap
JOIN
  actor a1 ON ap.actor_id_1 = a1.actor_id
JOIN
  actor a2 ON ap.actor_id_2 = a2.actor_id;

In [ ]:
#12
WITH RECURSIVE EmployeeHierarchy AS (
  SELECT
    staff_id,
    first_name,
    last_name,
    reports_to
  FROM
    staff
  WHERE
    reports_to = [Manager's Staff ID]  -- Replace with the desired manager's ID

  UNION ALL

  SELECT
    s.staff_id,
    s.first_name,
    s.last_name,
    s.reports_to
  FROM
    staff s
  JOIN
    EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)

SELECT
  *
FROM
  EmployeeHierarchy;